20260824/20260824/Documents/ПроизводственнаяОперация2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводственнаяОперация2_2</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СБ_ДвиженияДрагоценныхМеталлов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СБ_ДрагоценныеМеталлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДрагоценныеМатериалы</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛигатурныйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧистыйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СБ_ДрагоценныеМеталлыРасход</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДрагоценныеМатериалы</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛигатурныйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧистыйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

20260824/20260824/Documents/ПроизводственнаяОперация2_2/Ext/ManagerModule.bsl
&После("ЗаполнитьРеквизитыПриУстановкеСтатуса")
Процедура СБ_ЗаполнитьРеквизитыПриУстановкеСтатуса(Объект) Экспорт
	
	ЗаполнитьСерииВыходныхИзделий(Объект);
	
КонецПроцедуры

Процедура ЗаполнитьСерииВыходныхИзделий(Объект)
	
	ТаблицаИзделий 	= Объект.ВыходныеИзделия;
	ТаблицаСерий 	= Объект.ВыходныеИзделияСерии;
	Для Каждого СтрокаИ Из ТаблицаИзделий Цикл
		Если СтрокаИ.Номенклатура.ВидНоменклатуры.ИспользоватьСерии Тогда
			НовСтрокаСерий = ТаблицаСерий.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаСерий,СтрокаИ);
			НовСтрокаСерий.Серия =  СоздатьСерию(СтрокаИ.Номенклатура, Объект);
			СтрокаИ.СтатусУказанияСерий = 2;  
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры      

Функция СоздатьСерию(Номенклатура, Объект) 
	
	//Добавить дату производства и годен до
	
	Номер = "00000001";
	
	ВидНоменклатуры     = ?(ЗначениеЗаполнено(Номенклатура.ВидНоменклатуры.ВладелецСерий),Номенклатура.ВидНоменклатуры.ВладелецСерий,Номенклатура.ВидНоменклатуры);  
	НастройкиИспользованияСерий = Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(ВидНоменклатуры);
	НаборСвойствСерий = ВидНоменклатуры.НаборСвойствСерий.ДополнительныеРеквизиты;
	
	МаксимальныйНомер = Справочники.СерииНоменклатуры.ВычислитьМаксимальныйНомерСерии(ВидНоменклатуры);	
	
	Если МаксимальныйНомер<>0 Тогда 
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.ВидНоменклатуры 		= ВидНоменклатуры;	
		Серия.Номер               	= Формат(Число(СокрЛП(МаксимальныйНомер))+1, "ЧЦ=8; ЧВН=; ЧГ="); 
		Серия.ДатаПроизводства		= НачалоДня(?(Объект.ОкончаниеВыполнения = Дата(1,1,1),ТекущаяДата(),Объект.ОкончаниеВыполнения));
		Серия.ГоденДо				= НоменклатураКлиентСервер.ГоденДоПоДатеПроизводства(Серия.ДатаПроизводства, ?(Номенклатура.СрокГодности=0,1,Номенклатура.СрокГодности), Номенклатура.ЕдиницаИзмеренияСрокаГодности);
		Серия.Наименование        	= НоменклатураКлиентСервер.ПредставлениеСерииБезРасчетаПоШаблонуНаименования(НастройкиИспользованияСерий, Серия);
		Серия.RFIDМеткаНеЧитаемая 	= Ложь;
		//допреквизиты (партия детали, партия материала, штамп/пф)
		ТаблицаДР = Серия.ДополнительныеРеквизиты;
		Для Каждого СтрокаДР Из НаборСвойствСерий Цикл
			//Партия материалов
			Если СтрокаДР.Свойство.ИдентификаторДляФормул = "ПартияМатериала" Тогда
				НоваяСтрокаДр = ТаблицаДР.Добавить();
				НоваяСтрокаДр.Свойство = СтрокаДР.Свойство;
				НоваяСтрокаДр.Значение = НайтиСериюОсновногоМатериала(Объект.МатериалыИРаботы);
			//Штамп и П/ф
			ИначеЕсли СтрокаДР.Свойство.ИдентификаторДляФормул = "Штамп" ИЛИ СтрокаДР.Свойство.ИдентификаторДляФормул = "ПрессФорма" Тогда
				Оснастка = НайтиОснастку(Объект.Этап);
				Если ЗначениеЗаполнено(Оснастка) Тогда
					НоваяСтрокаДр = ТаблицаДР.Добавить();
					НоваяСтрокаДр.Свойство = СтрокаДР.Свойство;
					НоваяСтрокаДр.Значение = НайтиЗначениеДопРеквизита(СтрокаДР.Свойство, Оснастка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Серия.Записать();       	 
	Иначе  
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.ВидНоменклатуры 		= ВидНоменклатуры;	
		Серия.Номер               	= Номер; 
		Серия.ДатаПроизводства		= НачалоДня(?(Объект.ОкончаниеВыполнения = Дата(1,1,1),ТекущаяДата(),Объект.ОкончаниеВыполнения));
		Серия.ГоденДо				= НоменклатураКлиентСервер.ГоденДоПоДатеПроизводства(Серия.ДатаПроизводства, ?(Номенклатура.СрокГодности=0,1,Номенклатура.СрокГодности), Номенклатура.ЕдиницаИзмеренияСрокаГодности);
		Серия.Наименование        	= НоменклатураКлиентСервер.ПредставлениеСерииБезРасчетаПоШаблонуНаименования(НастройкиИспользованияСерий, Серия);
		Серия.RFIDМеткаНеЧитаемая 	= Ложь;
		//допреквизиты (партия детали, партия материала, штамп/пф)

		Серия.Записать();			             	
	КонецЕсли;	
	
	Возврат Серия.Ссылка;
	
КонецФункции      

Функция НайтиСериюОсновногоМатериала(Материалы);
	
	Партия = "";
	
	Отбор = Новый Структура();
	Отбор.Вставить("СтатьяКалькуляции",Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Основной материал"));
	Строки = Материалы.НайтиСтроки(Отбор);
	Если Строки.Количество()>0 Тогда
		Партия = Строки[0].Серия.Наименование;			
	КонецЕсли;
	
	Возврат Партия;
	
КонецФункции 

Функция НайтиЗначениеДопРеквизита(Свойство, Наименование) 
	
	ЗначениеДР = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Наименование,Истина,,Свойство);
	
	Если ЗначениеЗаполнено(ЗначениеДР) Тогда
		Возврат ЗначениеДР; 
	Иначе		
		НовоеЗначениеДР = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();   
		НовоеЗначениеДР.Владелец 		= Свойство;
		НовоеЗначениеДР.Наименование 	= Наименование;
		Попытка
			НовоеЗначениеДР.Записать();
			Возврат НовоеЗначениеДР.Ссылка;
		Исключение
			Возврат Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
		КонецПопытки;	
	КонецЕсли;
	
КонецФункции

Функция НайтиОснастку(Этап)
	
	Оснастка = "Нет";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра.Наименование КАК ВидРабочегоЦентраНаименование
		|ИЗ
		|	Документ.ЭтапПроизводства2_2.ВидыРабочихЦентров КАК ЭтапПроизводства2_2ВидыРабочихЦентров
		|ГДЕ
		|	ЭтапПроизводства2_2ВидыРабочихЦентров.Ссылка = &Ссылка
		|	И ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра.Родитель = &РодительШтамп
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра.Наименование
		|ИЗ
		|	Документ.ЭтапПроизводства2_2.ВидыРабочихЦентров КАК ЭтапПроизводства2_2ВидыРабочихЦентров
		|ГДЕ
		|	ЭтапПроизводства2_2ВидыРабочихЦентров.Ссылка = &Ссылка
		|	И ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра.Родитель = &РодительПФ";
	
	Запрос.УстановитьПараметр("РодительПФ", Справочники.ВидыРабочихЦентров.НайтиПоНаименованию("Пресс-формы"));
	Запрос.УстановитьПараметр("РодительШтамп", Справочники.ВидыРабочихЦентров.НайтиПоНаименованию("Штампы"));
	Запрос.УстановитьПараметр("Ссылка", Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ВидРабочегоЦентраНаименование;
	КонецЦикла;
	
	Возврат Оснастка;

	
КонецФункции
